[
    [{
        "name" : "Pokemon Tabletop Adventures Generator",
        "web": "https://api.github.com/repos/Rodrigo92HW/pta-generator",
        "webText" : "Updated at ",
        "text1": ["Pokemon Creation", "This website allows the customized creation of a Pokemon, generating unique data such as its type, abilities, characteristics, and moves. Additionally, users have the ability to modify these data at will.", "UseState, UseEffect, API Consumption"],
        "text2": ["Random Generation", "Capability to randomly generate Pokemon encounters, allowing users to designate these based on habitats, characteristics, or user preferences. Dynamic mapping, list, and filtering are employed.", "Mapping, Dynamic Lists and Filtering"],
        "text3": ["Internal Data Storage", "Data is stored locally to prevent loss of access to a user's Pokemon team if the page is reloaded. The information persists in future visits if the user accesses it from the same device, regardless of the device used.", "Use of Local Storage and Data Loading/Cleaning"],
        "link" : "https://rodrigo92hw.github.io/pta-generator/",
        "img": ["src/assets/images/PTA1.png", "src/assets/images/PTA2.png", "src/assets/images/PTA3.png"],
        "bannerImage" : ["https://editorial.unc.edu.ar/wp-content/uploads/sites/33/2022/09/placeholder.png", "https://editorial.unc.edu.ar/wp-content/uploads/sites/33/2022/09/placeholder.png", "https://editorial.unc.edu.ar/wp-content/uploads/sites/33/2022/09/placeholder.png"],
        "bannerText" : ["Selecting a Pokemon...", "Randomizing Pokemon...", "Persistent Data"],
        "longText": ["This website notably contributed to my personal development and, especially, led me to use React. The use of this library and its functions made the creation of the website possible. This website contains a system for creating Pokémon based on a popular tabletop role-playing game known as Pokémon Tabletop Adventures (https://linktr.ee/PokemonTabletopAdventures3). The purpose of creating this website was simple, as it was, in my personal opinion, an excellent system but also very challenging to implement. Many factors, such as the abundance of Pokémon, the need to consider complete teams, and the difficulty of generating interesting encounters when one must search through over 100 pages of content to find what they desire, led to the creation of this website where one can easily generate encounters and even have their own team always at hand (and even research future Pokémon of interest). The website contains various tabs, and at one point, there was consideration of saving the information to AWS and having a login system that would allow entry from multiple devices. However, legal issues would begin to arise because any case involving the use of a paid service would require fundraising and issues with Nintendo. The website currently has two functional sections: “Pokemon Team” and “Pokemon Encounter.” The first of these allows the player to access a list of Pokémon, ideally intended for carrying only a team of six, but there is the possibility of expanding the number of Pokémon with a button at the bottom of the page. The second section is supposed to be for the use of GMs to provide them with an easy alternative to create encounters, and while all Pokémon are created in their base versions, it is possible to specify their degree of evolution, whether they are legendary or not, and even search by environment, nature, or other factors."]
    },
    {
        "name" : "Reactivities",
        "web": "https://api.github.com/repos/Rodrigo92HW/Reactivities",
        "webText" : "Updated at ",
        "text1": ["Social Network", "Features of a social network, access to events and creation of events. Users can create accounts, add others to favorites, and follow their own events, as well as those they participate in or are interested in participating in.", "Internal API, MobX Usage, and Controllers"],
        "text2": ["Online Data Storage", "Information is uploaded to a database and persists across different devices. User information is encrypted and persists if the user has previously logged into the site, allowing logins from different devices simultaneously.", "Data Store, Account Creation, and Fly.io Usage"],
        "text3": ["Real-Time Chat and Updates", "Users have the ability to chat with others in real-time. Conversations persist on the site and can be deleted by the user who created them. The app constantly updates the stored data so that changes are felt in real-time by its users.", "Usage and Implementation of SignalR"],
        "link" : "https://rodrigo92hw.github.io/pta-generator/",
        "img": ["src/assets/images/Reactivities1.png", "src/assets/images/Reactivities2.png", "src/assets/images/Reactivities3.png"],
        "bannerImage" : ["https://editorial.unc.edu.ar/wp-content/uploads/sites/33/2022/09/placeholder.png", "https://editorial.unc.edu.ar/wp-content/uploads/sites/33/2022/09/placeholder.png", "https://editorial.unc.edu.ar/wp-content/uploads/sites/33/2022/09/placeholder.png"],
        "bannerText" : ["Loggin in and Home", "Creating an Activity", "Chatting"],
        "longText" : ["This project called 'reactivities' was created based on Udemy classes (https://www.udemy.com/course/complete-guide-to-building-an-app-with-net-core-and-react/), which I started at the end of 2023 and completed at the beginning of 2024.", "In this project, a web page is created as a social network similar to Facebook, X, and other similar social networks. Part of the motivation for this project was my desire to learn more seriously about web development, especially with React, guided by a teacher who taught lesson by lesson.", "This project helped me increase my knowledge of React and introduced me to very basic elements that I was unaware of, such as project structure, security encryption, and the use of various libraries such as MobX, SignalR, among others, to facilitate tasks.", "This is a complex web application, with a landing page that allows the creation or login of users (or you can simply log in with the user 'bob@test.com' and the password 'Pa$$w0rd'). Once inside, it leads to a section where a series of events or activities are displayed. You can explore activities created by other users, comment on them, follow them, and perform other typical social network functions.", "You also have the possibility to create your own events and organize them as you wish. You can edit your own profile and explore the profiles of other users, follow or unfollow them. Any type of update or event that occurs on the website is updated in real-time for other connected users."]
    }],
    [{
        "name" : "Pokemon Tabletop Adventures Generator",
        "web": "https://api.github.com/repos/Rodrigo92HW/pta-generator",
        "webText" : "Ultima actualización el ",
        "text1": ["Creación de Pokemon", "Esta web permite crear de forma personalizada a un Pokemon, generando sus datos únicos como su tipo, habilidades, características y movimientos. Además de la posibilidad de modificar estos a voluntad.", "UseState, UseEffect, Consumo de API"],
        "text2": ["Generación Aleatoria", "Capacidad de generar de forma aleatoria encuentros con Pokemon, pudiendo designar a estos basados en sus hábitats, caracterizas o preferencias a elección del usuario.", "Mapping, listas y filtrado dinámico"],
        "text3": ["Almacen Interno de Data", "La data es guardada localmente para evitar que uno pierda el acceso a su equipo Pokemon si la pagina es recargada. La información persiste en futuros ingresos a este si se realiza dicho ingreso a través de mismo dispositivo, sin importar cual sea este.", "Uso de Local Storage y carga/limpieza de Datos"],
        "link" : "https://rodrigo92hw.github.io/pta-generator/",
        "img": ["src/assets/images/PTA1.png", "src/assets/images/PTA2.png", "src/assets/images/PTA3.png"],
        "bannerImage" : ["https://editorial.unc.edu.ar/wp-content/uploads/sites/33/2022/09/placeholder.png", "https://editorial.unc.edu.ar/wp-content/uploads/sites/33/2022/09/placeholder.png", "https://editorial.unc.edu.ar/wp-content/uploads/sites/33/2022/09/placeholder.png"],
        "bannerText" : ["Eligiendo Pokemon...", "Pokemon Aleatorios...", "Persistencia de Data"],
        "longText" : ["Esta web sirvió notoriamente para mi desarrollo personal y en especial me llevo al uso de React, el uso de esta librería y de sus funciones hizo posible la creación de la web.", "Esta página web contiene un sistema para la creación de Pokemon basado en un popular juego de rol de mesa conocida como Pokemon Tabletop Adventures (https://linktr.ee/PokemonTabletopAdventures3). El propósito de la creación de esta web era simple, pues este era en mi opinión personal, un excelente sistema, pero también uno muy difícil de llevar adelante.", "Muchos factores como la abundancia de Pokemons, la necesidad de tener en cuenta equipos completos y la dificultad de generar encuentros interesantes cuando uno debe investigar en mas de 100 paginas de contenido para encontrar lo que se desea, llevo a la creación de esta web en donde uno puede muy fácilmente generar encuentros e inclusive tener su propio equipo siempre al alcance de la mano (e inclusive investigar futuros Pokemon que sean de su interés).", "La pagina web contiene diversas pestañas y en su momento estaba pensada la posibilidad de guardar en AWS la información y tener un sistema de LogIn que permitiese entrar por varios dispositivos. Pero temas legales empezarían a presentarse porque cualquier caso en donde se emplee un servicio pago requeriría recaudación de fondos y problemas con Nintendo.", "La pagina web en este momento posee dos secciones funcionales: “Pokemon Team” y “Pokemon Encounter”. El primero de estos permite al jugador tener acceso a una lista de Pokemons, idealmente esta pensado para que solo se pueda llevar un equipo de seis, pero existe la posibilidad de expandir el numero de Pokemon con un botón que se encuentra en el pie de la página. La segunda sección se supone que es para el uso de los GM, para posibilitar a estos una alternativa fácil para crear encuentros y si bien todos los Pokemon son creados en sus versiones base, es posible especificar su grado de evolución, si es legendario o no, e inclusive permite buscar por ambiente, naturaleza u otros factores."]
    },
    {
        "name" : "Reactivities",
        "web": "https://api.github.com/repos/Rodrigo92HW/Reactivities",
        "webText" : "Ultima actualización el ",
        "text1": ["Red Social", "Funciones propias de red social, acceso a eventos y creación de los mismos, posibilidad de crear usuarios, agregar estos a favoritos, además de poder seguir los eventos propios, en los que se participa o los que se tiene interés en participar.", "API Interna, uso de MobX y Controladores."],
        "text2": ["Almacen de Data en Linea", "La información es subida a una base de datos y persiste en distintos dispositivos, la información de usuarios es cifrada y persiste si este ha ingresado anteriormente al sitio, pudiendo ingresar desde diferentes dispositivos al mismo tiempo.", "Store de datos, creación de Cuenta y uso de Fly.io"],
        "text3": ["Chat y Updates en Vivo", "Posibilidad de chatear con otros usuarios en tiempo real, las conversaciones persisten en el sitio y pueden ser borradas por el usuario que las creo. La App actualiza la data guardada en esta de forma constante de manera que, los cambios son sentidos en vivo por sus usuarios.", "Uso y aplicación de SignalR"],
        "link" : "https://rodrigo92hw.github.io/pta-generator/",
        "img": ["src/assets/images/Reactivities1.png", "src/assets/images/Reactivities2.png", "src/assets/images/Reactivities3.png"],
        "bannerImage" : ["https://editorial.unc.edu.ar/wp-content/uploads/sites/33/2022/09/placeholder.png", "https://editorial.unc.edu.ar/wp-content/uploads/sites/33/2022/09/placeholder.png", "https://editorial.unc.edu.ar/wp-content/uploads/sites/33/2022/09/placeholder.png"],
        "bannerText" : ["Ingreso y Home", "Creando una Actividad", "Chateando"],
        "longText" : ["Este proyectó llamado reactivities fue creado a partir de clases de Udemy (https://www.udemy.com/course/complete-guide-to-building-an-app-with-net-core-and-react/) las cuales inicié a fines del 2023 y concluí a principios del 2024.", "En este se crea una pagina web a modo red social como lo es Facebook, X y las demás redes sociales similares, en parte este proyectó fue encarado por mi voluntad de aprender mas seriamente como era el desarrollo web y en especial con React, y en este caso, guiadas por un profesor que enseñase lección a lección.", "Este proyectó me sirvió para aumentar mis conocimientos de React y darme a conocer elementos muy básicos que desconocía, como son la estructura de un proyectó, cifrados de seguridad y también el uso de diversas librerías como MobX, SignalR entre otros, para facilitar tareas.", "Esta es una web compleja, con una pagina donde uno aterriza que permite la creación o ingreso de usuarios (o uno puede simplemente entrar con usuario bob@test.com y la contraseña Pa$$w0rd), y una vez dentro lleva a una sección donde se encuentren una serie de eventos o actividades, uno puede explorar actividades creadas por otros usuarios, comentar en las mismas, seguir a estos y demás funciones típicas de redes sociales.", "Uno también tiene la posibilidad de crear sus propios eventos y organizar estos como se desee, uno puede editar su propio perfil además de poder explorar perfil de otros usuarios y seguir o dejar de seguir a estos. Cualquier tipo de actualización o evento que ocurra en la web es actualizado en tiempo real a los demás usuarios conectados."]
    }]
]